/**
 * @brief		哨兵调试记录区，将遇到的问题以及解决方案记下来，留给之后的人参考
 * @date		2025/1/8
 * @version		1.0
 
 *      ┌─┐       ┌─┐ + +
 *   ┌──┘ ┴───────┘ ┴──┐++
 *   │                 │
 *   │       ───       │++ + + +
 *   ███████───███████ │+
 *   │                 │+
 *   │       ─┴─       │
 *   │                 │
 *   └───┐         ┌───┘
 *       │         │
 *       │         │   + +
 *       │         │
 *       │         └──────────────┐
 *       │                        │
 *       │                        ├─┐
 *       │                        ┌─┘
 *       │                        │
 *       └─┐  ┐  ┌───────┬──┐  ┌──┘  + + + +
 *         │ ─┤ ─┤       │ ─┤ ─┤
 *         └──┴──┘       └──┴──┘  + + + +
 *              
 *               代码无BUG!
 */
 
/**
 * @question	yaw轴与pitch轴相互干涉，运动yaw轴，pitch轴强烈运动
 * @solve		与陀螺仪安装方式有关，yaw、pitch轴是我们人为定义、由代码里定义建立坐标系，要么保证安装方式不变，要么好好研究INS_date,在解算的角度里增减正负号
 * @date		2024/10/18
 */
 
 /**
 * @question	所有电机正常，线也插对，但是无数据反馈
 * @solve		同个CAN线上挂载过多设备，由吉大的测试反馈，CAN线挂载最多8个，之后优先级低的回接收不到信号。挂载多了，电调的接收频率会降低，可以主动稍微降低不重要的设备
 * @date		2024/10/15
 */
 
 